icprog/WT-8A46/Drivers/BSP/STM32F429I-WireTester/stm32f429i_WireTester.h
/**
  ******************************************************************************
  * @file    stm32f429i_WireTester.h
  * @author  MCD Application Team
  * @version V2.1.1
  * @date    10-December-2014
  * @brief   This file contains definitions for STM32F429I-Discovery Kit LEDs,
  *          push-buttons hardware resources.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F429I_DISCOVERY_H
#define __STM32F429I_DISCOVERY_H

#ifdef __cplusplus
 extern "C" {
#endif
                                              
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
   

// DMA Define
/**************************************************
DMA1_Stream4					EEPROM_I2C_DMA_STREAM_TX 
DMA1_Stream2					EEPROM_I2C_DMA_STREAM_RX
DMA2_Stream0					SDRAM_DMAx_STREAM
DMA2_Stream0	 				ADCx_DMA_STREAM
DMA2_Stream6	 				SD_DMAx_Tx_STREAM
DMA2_Stream3	 				SD_DMAx_Rx_STREAM
   
**************************************************/	 





/** 
  * @brief  Define for STM32F429I_DISCO board  
  */ 
#if !defined (USE_STM32F429I_DISCO)
 #define USE_STM32F429I_DISCO
#endif


  


/** @addtogroup STM32F429I_DISCOVERY LOW_LEVEL_BUS
  * @{
  */  
/* Exported constanIO --------------------------------------------------------*/
//#define IO_I2C_ADDRESS                      0x82 
//#define TS_I2C_ADDRESS                      0x82

//#ifdef EE_M24LR64
//#define EEPROM_I2C_ADDRESS_A01              0xA0
//#define EEPROM_I2C_ADDRESS_A02              0xA6
//#endif /* EE_M24LR64 */ 


/*##################### I2Cx ###################################*/
/* User can use this section to tailor I2Cx instance used and associated 
   resources */
//#define DISCOVERY_I2Cx                          I2C1
//#define DISCOVERY_I2Cx_CLOCK_ENABLE()           __I2C1_CLK_ENABLE()
//#define DISCOVERY_I2Cx_FORCE_RESET()            __I2C1_FORCE_RESET()
//#define DISCOVERY_I2Cx_RELEASE_RESET()          __I2C1_RELEASE_RESET()
//#define DISCOVERY_I2Cx_SDA_GPIO_CLK_ENABLE()    __GPIOB_CLK_ENABLE()
//#define DISCOVERY_I2Cx_SCL_GPIO_CLK_ENABLE()    __GPIOB_CLK_ENABLE() 
//#define DISCOVERY_I2Cx_SDA_GPIO_CLK_DISABLE()   __GPIOB_CLK_DISABLE()

///* Definition for DISCO I2Cx Pins */
//#define DISCOVERY_I2Cx_SCL_PIN                  GPIO_PIN_6
//#define DISCOVERY_I2Cx_SCL_GPIO_PORT            GPIOB
//#define DISCOVERY_I2Cx_SCL_SDA_AF               GPIO_AF4_I2C1
//#define DISCOVERY_I2Cx_SDA_PIN                  GPIO_PIN_7
//#define DISCOVERY_I2Cx_SDA_GPIO_PORT            GPIOB

///* Definition for IOE I2Cx's NVIC */
//#define DISCOVERY_I2Cx_EV_IRQn                  I2C1_EV_IRQn
//#define DISCOVERY_I2Cx_ER_IRQn                  I2C1_ER_IRQn

///* I2C clock speed configuration (in Hz) 
//  WARNING: 
//   Make sure that this define is not already declared in other files (ie. 
//  stm324x9i_disco.h file). It can be used in parallel by other modules. */
//#ifndef I2C_SPEED
// #define I2C_SPEED                          100000
//#endif /* I2C_SPEED */



///*##################### SPIx ###################################*/



///*##################### IOE ###################################*/
///** 
//  * @brief  IOE Control pin  
//  */ 
///* Definition for external IT for STMPE811 */
//#define STMPE811_INT_PIN                        GPIO_PIN_5
//#define STMPE811_INT_GPIO_PORT                  GPIOC
//#define STMPE811_INT_CLK_ENABLE()               __GPIOC_CLK_ENABLE()
//#define STMPE811_INT_CLK_DISABLE()              __GPIOC_CLK_DISABLE()
//#define STMPE811_INT_EXTI                       EXTI9_5_IRQn
//#define STMPE811_INT_EXTIHandler                EXTI9_5_IRQHandler
/**
  * @}
  */ 











/*###########################################################################################*/

/** 
  * @brief  LZY Wire Tester Pin Define 
  */ 

/*##################### LED Run ######################################################################*/

/** @addtogroup WT LOW_LEVEL_LED
  * @{
  */
//#define LEDn                                    2
//  
//#define LED3_PIN                                GPIO_PIN_8
//#define LED3_GPIO_PORT                          GPIOF
//#define LED3_GPIO_CLK_ENABLE()                  __GPIOF_CLK_ENABLE()  
//#define LED3_GPIO_CLK_DISABLE()                 __GPIOF_CLK_DISABLE()  


//#define LED4_PIN                                GPIO_PIN_9
//#define LED4_GPIO_PORT                          GPIOF
//#define LED4_GPIO_CLK_ENABLE()                  __GPIOF_CLK_ENABLE()  
//#define LED4_GPIO_CLK_DISABLE()                 __GPIOF_CLK_DISABLE()  

//#define LEDx_GPIO_CLK_ENABLE(__INDEX__)         (((__INDEX__) == 0) ? LED3_GPIO_CLK_ENABLE() : LED4_GPIO_CLK_ENABLE())
//#define LEDx_GPIO_CLK_DISABLE(__INDEX__)        (((__INDEX__) == 0) ? LED3_GPIO_CLK_DISABLE() : LED4_GPIO_CLK_DISABLE())


