icprog/WT-8A46/Drivers/BSP/STM32F429I-WireTester/stm32f429i_WireTester.h
#define LED_RUN_PIN                             GPIO_PIN_9	//PF9
#define LED_PORT                                GPIOF
#define LED_GPIO_CLK_ENABLE()                   __GPIOF_CLK_ENABLE()  
#define LED_GPIO_CLK_DISABLE()                  __GPIOF_CLK_DISABLE()

#define LED_RUN_ON  														HAL_GPIO_WritePin(LED_PORT, LED_RUN_PIN, GPIO_PIN_RESET)
#define LED_RUN_OFF 														HAL_GPIO_WritePin(LED_PORT, LED_RUN_PIN, GPIO_PIN_SET)

/*##################### Infrared & RFU ####################################################################*/

#define IO_RFU_PB0_PIN		                     	GPIO_PIN_0	//PB0
#define IO_RFU_Infr_PIN                      		GPIO_PIN_1	//PB1
#define IO_RFU_0_PORT                           GPIOB
#define IO_RFU_0_GPIO_CLK_ENABLE()              __GPIOB_CLK_ENABLE()  
#define IO_RFU_0_GPIO_CLK_DISABLE()             __GPIOB_CLK_DISABLE()

#define IO_RFU_PF6_PIN		                      GPIO_PIN_6	//PF6
#define IO_RFU_PF7_PIN		                      GPIO_PIN_7	//PF7
#define IO_RFU_1_PORT                           GPIOF
#define IO_RFU_1_GPIO_CLK_ENABLE()              __GPIOF_CLK_ENABLE()  
#define IO_RFU_1_GPIO_CLK_DISABLE()             __GPIOF_CLK_DISABLE()

#define IO_INFRARED_TX_PIN                     GPIO_PIN_6	//PC6
#define IO_INFRARED_RX_PIN                     GPIO_PIN_7	//PC7
#define INFRARED_PORT                          GPIOC
#define INFRARED_GPIO_CLK_ENABLE()             __GPIOC_CLK_ENABLE()  
#define INFRARED_GPIO_CLK_DISABLE()            __GPIOC_CLK_DISABLE()

#define INFRARED_RUN_ON  											 HAL_GPIO_WritePin(INFRARED_PORT, IO_INFRARED_TX_PIN, GPIO_PIN_SET)
#define INFRARED_RUN_OFF 											 HAL_GPIO_WritePin(INFRARED_PORT, IO_INFRARED_TX_PIN, GPIO_PIN_RESET)

/*##################### DIO & DIN ####################################################################*/

#define DIO_IN1_PIN                             GPIO_PIN_11	//PD11
#define DIO_IN2_PIN                             GPIO_PIN_12	//PD12
#define DIO_IN3_PIN                             GPIO_PIN_13	//PD13
#define DIO_IN_PORT                             GPIOD
#define DIO_IN_GPIO_CLK_ENABLE()                __GPIOD_CLK_ENABLE()  
#define DIO_IN_GPIO_CLK_DISABLE()               __GPIOD_CLK_DISABLE()

#define DIO_IN_LOCK_PIN                         GPIO_PIN_8	//PI8
#define DIO_IN_LOCK_PORT                        GPIOI
#define DIO_IN_LOCK_GPIO_CLK_ENABLE()           __GPIOI_CLK_ENABLE()  
#define DIO_IN_LOCK_GPIO_CLK_DISABLE()          __GPIOI_CLK_DISABLE()

#define DIO_OUT1_PIN                            GPIO_PIN_2
#define DIO_OUT2_PIN                            GPIO_PIN_3
#define DIO_OUT3_PIN                            GPIO_PIN_9
#define DIO_OUT_PORT                            GPIOG
#define DIO_OUT_GPIO_CLK_ENABLE()               __GPIOG_CLK_ENABLE()  
#define DIO_OUT_GPIO_CLK_DISABLE()              __GPIOG_CLK_DISABLE()


#define DOUT_1_ON																HAL_GPIO_WritePin(DIO_OUT_PORT, DIO_OUT1_PIN, GPIO_PIN_SET) 
#define DOUT_1_OFF															HAL_GPIO_WritePin(DIO_OUT_PORT, DIO_OUT1_PIN, GPIO_PIN_RESET)
#define DOUT_2_ON																HAL_GPIO_WritePin(DIO_OUT_PORT, DIO_OUT2_PIN, GPIO_PIN_SET)
#define DOUT_2_OFF															HAL_GPIO_WritePin(DIO_OUT_PORT, DIO_OUT2_PIN, GPIO_PIN_RESET)
#define DOUT_3_ON																HAL_GPIO_WritePin(DIO_OUT_PORT, DIO_OUT3_PIN, GPIO_PIN_SET)
#define DOUT_3_OFF															HAL_GPIO_WritePin(DIO_OUT_PORT, DIO_OUT3_PIN, GPIO_PIN_RESET)


/*##################### KEY & LED ######################################################################*/

#define KEYLED_DAT0_PIN                         GPIO_PIN_2
#define KEYLED_DAT1_PIN                         GPIO_PIN_3
#define KEYLED_DAT2_PIN                         GPIO_PIN_4
#define KEYLED_DATx_PORT                        GPIOH
#define KEYLED_DATx_GPIO_CLK_ENABLE()           __GPIOH_CLK_ENABLE()  
#define KEYLED_DATx_GPIO_CLK_DISABLE()          __GPIOH_CLK_DISABLE()

#define KEYLED_LCH_PIN                          GPIO_PIN_7	//PD7
#define KEYLED_CTL_LCH_PORT                     GPIOD
#define KEYLED_CTL_LCH_GPIO_CLK_ENABLE()        __GPIOD_CLK_ENABLE()  
#define KEYLED_CTL_LCH_GPIO_CLK_DISABLE()       __GPIOD_CLK_DISABLE()

#define KEYLED_CLK_PIN                          GPIO_PIN_3	//PI3
#define KEYLED_DAT_PIN                          GPIO_PIN_11	//PI11
#define KEYLED_CTL_PORT                         GPIOI
#define KEYLED_CTL_GPIO_CLK_ENABLE()            __GPIOI_CLK_ENABLE()  
#define KEYLED_CTL_GPIO_CLK_DISABLE()           __GPIOI_CLK_DISABLE()


#define KL_CLK_H																HAL_GPIO_WritePin(KEYLED_CTL_PORT, KEYLED_CLK_PIN, GPIO_PIN_RESET)
#define KL_CLK_L																HAL_GPIO_WritePin(KEYLED_CTL_PORT, KEYLED_CLK_PIN, GPIO_PIN_SET)
#define KL_LCH_H																HAL_GPIO_WritePin(KEYLED_CTL_LCH_PORT, KEYLED_LCH_PIN, GPIO_PIN_RESET)
#define KL_LCH_L																HAL_GPIO_WritePin(KEYLED_CTL_LCH_PORT, KEYLED_LCH_PIN, GPIO_PIN_SET)
#define KL_DAT_H																HAL_GPIO_WritePin(KEYLED_CTL_PORT, KEYLED_DAT_PIN, GPIO_PIN_RESET)
#define KL_DAT_L																HAL_GPIO_WritePin(KEYLED_CTL_PORT, KEYLED_DAT_PIN, GPIO_PIN_SET)


#define KEYWHEEL_1_PIN                          GPIO_PIN_3	//PB3
#define KEYWHEEL_2_PIN                          GPIO_PIN_4	//PB4
#define KEYWHEEL_PORT                           GPIOB
#define KEYWHEEL_GPIO_CLK_ENABLE()              __GPIOB_CLK_ENABLE()  
#define KEYWHEEL_GPIO_CLK_DISABLE()             __GPIOB_CLK_DISABLE()
#define KEYWHEEL_1_INT_EXTI                     EXTI3_IRQn
#define KEYWHEEL_1_INT_EXTIHandler              EXTI3_IRQHandler
#define KEYWHEEL_1_INT_PREPRIO                  15
#define KEYWHEEL_2_INT_EXTI                     EXTI4_IRQn
#define KEYWHEEL_2_INT_EXTIHandler              EXTI4_IRQHandler
#define KEYWHEEL_2_INT_PREPRIO                  15

/*##################### USB #####################################################################*/

#define USBOTG_POWER_SW_PIN                     GPIO_PIN_4		// USB power switch
#define USBOTG_POWER_OC_PIN                     GPIO_PIN_5		// over current limit
#define USBOTG_POWER_PORT                       GPIOC
#define USBOTG_POWER_GPIO_CLK_ENABLE()          __GPIOC_CLK_ENABLE()  
#define USBOTG_POWER_GPIO_CLK_DISABLE()         __GPIOC_CLK_DISABLE()

#define USBOTG_POWER_OC_INT_EXTI                EXTI9_5_IRQn
#define USBOTG_POWER_OC_INT_EXTIHandler         EXTI9_5_IRQHandler
#define USBOTG_POWER_OC_INT_PREPRIO             15

#define USBOTG_FS_ID_PIN                        GPIO_PIN_12		// maybe not use
#define USBOTG_FS_VBUS_PIN                      GPIO_PIN_13
#define USBOTG_FS_DM_PIN                        GPIO_PIN_14
#define USBOTG_FS_DP_PIN                        GPIO_PIN_15
#define USBOTG_FS_PORT                          GPIOB
#define USBOTG_FS_GPIO_CLK_ENABLE()             __GPIOB_CLK_ENABLE()  
#define USBOTG_FS_GPIO_CLK_DISABLE()            __GPIOB_CLK_DISABLE()



/*##################### SDIO ####################################################################*/

#define SDIO_D0_PIN                             GPIO_PIN_8
#define SDIO_D1_PIN                             GPIO_PIN_9
#define SDIO_D2_PIN                             GPIO_PIN_10
#define SDIO_D3_PIN                             GPIO_PIN_11
#define SDIO_CK_PIN                             GPIO_PIN_12
#define SDIO_DETECT_PIN                         GPIO_PIN_13
#define SDIO_DAT_PORT                           GPIOC
#define SDIO_DAT_GPIO_CLK_ENABLE()              __GPIOC_CLK_ENABLE()  
#define SDIO_DAT_GPIO_CLK_DISABLE()             __GPIOC_CLK_DISABLE()

#define SDIO_CMD_PIN                            GPIO_PIN_2
#define SDIO_CMD_PORT                           GPIOD
#define SDIO_CMD_GPIO_CLK_ENABLE()              __GPIOD_CLK_ENABLE()  
#define SDIO_CMD_GPIO_CLK_DISABLE()             __GPIOD_CLK_DISABLE()


/*##################### FM24C64 - I2C ###########################################################*/

#define FM24C64_I2C_SCL_PIN                     GPIO_PIN_6
#define FM24C64_I2C_SDA_PIN                     GPIO_PIN_7
#define FM24C64_I2C_SCL_SDA_AF               		GPIO_AF4_I2C1
#define FM24C64_I2C_PORT                        GPIOB

#define FM24C64_I2C_CLOCK_ENABLE()           		__I2C1_CLK_ENABLE()
#define FM24C64_I2C_FORCE_RESET()            		__I2C1_FORCE_RESET()
#define FM24C64_I2C_RELEASE_RESET()          		__I2C1_RELEASE_RESET()
#define FM24C64_I2C_GPIO_CLK_ENABLE()           __GPIOB_CLK_ENABLE()  
#define FM24C64_I2C_GPIO_CLK_DISABLE()          __GPIOB_CLK_DISABLE()

