icprog/WT-8A46/Drivers/BSP/STM32F429I-WireTester/stm32f429i_WireTester.h
/* Definition for IOE I2Cx's NVIC */
#define FM24C64_I2C_EV_IRQn                  		I2C1_EV_IRQn
#define FM24C64_I2C_ER_IRQn                  		I2C1_ER_IRQn

#define I2Cx_SPEED                          		100000	/* I2C clock speed configuration (in Hz) */
#define I2Cx_TIMEOUT_MAX                    		0x3000 	/*<! The value of the maximal timeout for I2C waiting loops */

#define FM24C64_I2C                          		I2C1
#define FM24C64_I2C_ADDRESS              				0xA0




/*##################### FM25V01 - SPI ###########################################################*/

#define FM25V01_SPI_MISO_PIN                    GPIO_PIN_12
#define FM25V01_SPI_SCK_PIN                     GPIO_PIN_13
#define FM25V01_SPI_MOSI_PIN                    GPIO_PIN_14
#define FM25V01_SPI_AF                       		GPIO_AF5_SPI6
#define FM25V01_SPI_PORT                        GPIOG
#define FM25V01_SPI_GPIO_CLK_ENABLE()           __GPIOG_CLK_ENABLE()  
#define FM25V01_SPI_GPIO_CLK_DISABLE()          __GPIOG_CLK_DISABLE()

#define FM25V01_SPI_CLK_ENABLE()             		__SPI6_CLK_ENABLE()
#define FM25V01_SPI                          		SPI6

#define FM25V01_SPI_NSS_PIN                     GPIO_PIN_15
#define FM25V01_SPI_NSS_PORT                    GPIOA
#define FM25V01_SPI_NSS_GPIO_CLK_ENABLE()       __GPIOA_CLK_ENABLE()  
#define FM25V01_SPI_NSS_GPIO_CLK_DISABLE()      __GPIOA_CLK_DISABLE()


/* Maximum Timeout values for flags waiting loops. These timeouts are not based
   on accurate values, they just guarantee that the application will not remain
   stuck if the SPI communication is corrupted.
   You may modify these timeout values depending on CPU frequency and application
   conditions (interrupts routines ...). */   
#define SPIx_TIMEOUT_MAX              ((uint32_t)0x1000)


// FM25V10 Command Define
#define FM25V_WREN			0x06	//Set Write Enable Latch 
#define FM25V_WRDI			0x04	//Write Disable
#define FM25V_RDSR			0x05	//Read Status Register
#define FM25V_WRSR			0x01	//Write Status Register
#define FM25V_READ			0x03	//Read Memory Data
#define FM25V_FSTRD			0x0B	//Fast Read Memory Data
#define FM25V_WRITE			0x02	//Write Memory Data
#define FM25V_SLEEP			0xB9	//Enter Sleep Mode
#define FM25V_RDID			0x9F	//Read Device ID
#define FM25V_SNR				0xC3	//Read S/N


#define FM25V_NSS_L()			HAL_GPIO_WritePin(FM25V01_SPI_NSS_PORT, FM25V01_SPI_NSS_PIN, GPIO_PIN_RESET)
#define FM25V_NSS_H()			HAL_GPIO_WritePin(FM25V01_SPI_NSS_PORT, FM25V01_SPI_NSS_PIN, GPIO_PIN_SET)


/*##################### AD Control ##############################################################*/

#define AD_SOURSE_A0_PIN                        GPIO_PIN_4
#define AD_SOURSE_A1_PIN                        GPIO_PIN_5
#define AD_SOURSE_A2_PIN                        GPIO_PIN_6
#define AD_SOURSE_C0_PIN                        GPIO_PIN_7
#define AD_SOURSE_C1_PIN                        GPIO_PIN_8
#define AD_SOURSE_C2_PIN                        GPIO_PIN_11
#define AD_SOURSE_RDC_PIN                       GPIO_PIN_12
#define AD_SOURSE_PORT                          GPIOA
#define AD_SOURSE_GPIO_CLK_ENABLE()             __GPIOA_CLK_ENABLE()  
#define AD_SOURSE_GPIO_CLK_DISABLE()            __GPIOA_CLK_DISABLE()

#define AD_CTL_FindPoint_PIN										GPIO_PIN_8
#define AD_CTL_PORT                             GPIOF
#define AD_CTL_GPIO_CLK_ENABLE()                __GPIOF_CLK_ENABLE()  
#define AD_CTL_GPIO_CLK_DISABLE()               __GPIOF_CLK_DISABLE()

//#define AD_SIGNAL_VALUE_PIN                     GPIO_PIN_0
#define AD_SIGNAL_V01_PIN                       GPIO_PIN_1
#define AD_SIGNAL_V10_PIN                       GPIO_PIN_2
#define AD_SIGNAL_SBD_PIN                       GPIO_PIN_3
#define AD_SIGNAL_PORT                          GPIOC
#define AD_SIGNAL_GPIO_CLK_ENABLE()             __GPIOC_CLK_ENABLE()  
#define AD_SIGNAL_GPIO_CLK_DISABLE()            __GPIOC_CLK_DISABLE()

//#define AD_UART_TX_PIN                          GPIO_PIN_7
//#define AD_UART_RX_PIN                          GPIO_PIN_6
//#define AD_UART_PORT                            GPIOF
//#define AD_UART_GPIO_CLK_ENABLE()               __GPIOF_CLK_ENABLE()  
//#define AD_UART_GPIO_CLK_DISABLE()              __GPIOF_CLK_DISABLE()
//#define AD_UART_CLK_ENABLE()               			__UART7_CLK_ENABLE()

/*##################### CC2PC Control ##############################################################*/
#define PS_MISO_DAT1                         			GPIO_PIN_3
#define PS_MISO_DAT2                         			GPIO_PIN_4
#define PS_MISO_DAT3                         			GPIO_PIN_5
#define PS_MISO_DAT4                         			GPIO_PIN_6
#define PS_MISO_PORT                      				GPIOD
#define PS_MISO_GPIO_CLK_ENABLE()         				__GPIOD_CLK_ENABLE()  
#define PS_MISO_GPIO_CLK_DISABLE()        				__GPIOD_CLK_DISABLE()

#define PS_MOSI_EN_sRX_PIN                        GPIO_PIN_2		//slave RX enable
#define PS_MOSI_CLK_PIN                         	GPIO_PIN_3
#define PS_MOSI_DAT0_PIN                         	GPIO_PIN_4
#define PS_MOSI_DAT1_PIN                         	GPIO_PIN_5
#define PS_MOSI_EN_sTX_PIN                        GPIO_PIN_6		//slave TX enable
#define PS_MOSI_PORT                      				GPIOE
#define PS_MOSI_GPIO_CLK_ENABLE()         				__GPIOE_CLK_ENABLE()  
#define PS_MOSI_GPIO_CLK_DISABLE()        				__GPIOE_CLK_DISABLE()

#define PS_MOSI_CLK_H															HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_CLK_PIN, GPIO_PIN_SET)
#define PS_MOSI_CLK_L															HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_CLK_PIN, GPIO_PIN_RESET)
#define PS_MOSI_EN_sRX_H													HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_EN_sRX_PIN, GPIO_PIN_SET)
#define PS_MOSI_EN_sRX_L													HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_EN_sRX_PIN, GPIO_PIN_RESET)
#define PS_MOSI_EN_sTX_H													HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_EN_sTX_PIN, GPIO_PIN_SET)
#define PS_MOSI_EN_sTX_L													HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_EN_sTX_PIN, GPIO_PIN_RESET)
#define PS_MOSI_DAT0_H														HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_DAT0_PIN, GPIO_PIN_SET)
#define PS_MOSI_DAT0_L														HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_DAT0_PIN, GPIO_PIN_RESET)
#define PS_MOSI_DAT1_H														HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_DAT1_PIN, GPIO_PIN_SET)
#define PS_MOSI_DAT1_L														HAL_GPIO_WritePin(PS_MOSI_PORT, PS_MOSI_DAT1_PIN, GPIO_PIN_RESET)
//----------------------------------------------------------------------------
/* User can use this section to tailor ADCx instance used and associated 
   resources */
/* Definition for ADCx clock resources */
#define ADCx                            ADC3
#define ADCx_CLK_ENABLE()               __ADC3_CLK_ENABLE()
#define DMAx_CLK_ENABLE()               __DMA2_CLK_ENABLE()     
#define ADCx_CHANNEL_GPIO_CLK_ENABLE()  __GPIOC_CLK_ENABLE()
     
#define ADCx_FORCE_RESET()              __ADC_FORCE_RESET()
#define ADCx_RELEASE_RESET()            __ADC_RELEASE_RESET()

/* Definition for ADCx Channel Pin */
#define ADCx_CHANNEL_PIN                GPIO_PIN_0
#define ADCx_CHANNEL_GPIO_PORT          GPIOC 

/* Definition for ADCx's Channel */
#define ADCx_CHANNEL                    ADC_CHANNEL_10

/* Definition for ADCx's DMA */
#define ADCx_DMA_CHANNEL                DMA_CHANNEL_2
#define ADCx_DMA_STREAM                 DMA2_Stream1         

/* Definition for ADCx's NVIC */
#define ADCx_DMA_IRQn                   DMA2_Stream1_IRQn
#define ADCx_DMA_IRQHandler             DMA2_Stream1_IRQHandler


/*##################### USART 1_2_3_4 (_6) #######################################################*/

#define USARTn																	5

#define USART1_TX_PIN                           GPIO_PIN_9
#define USART1_RX_PIN                           GPIO_PIN_10
#define USART1_PORT                             GPIOA
#define USART1_GPIO_CLK_ENABLE()                __GPIOA_CLK_ENABLE()  
#define USART1_GPIO_CLK_DISABLE()               __GPIOA_CLK_DISABLE()
#define USART1_CLK_ENABLE()               			__USART1_CLK_ENABLE()

#define USART2_TX_PIN                           GPIO_PIN_2
#define USART2_RX_PIN                           GPIO_PIN_3
#define USART2_PORT                             GPIOA
#define USART2_GPIO_CLK_ENABLE()                __GPIOA_CLK_ENABLE()  
#define USART2_GPIO_CLK_DISABLE()               __GPIOA_CLK_DISABLE()
#define USART2_CLK_ENABLE()               			__USART2_CLK_ENABLE()

#define USART3_TX_PIN                           GPIO_PIN_10
#define USART3_RX_PIN                           GPIO_PIN_11
#define USART3_PORT                             GPIOB
#define USART3_GPIO_CLK_ENABLE()                __GPIOB_CLK_ENABLE()  
#define USART3_GPIO_CLK_DISABLE()               __GPIOB_CLK_DISABLE()
#define USART3_CLK_ENABLE()               			__USART3_CLK_ENABLE()

#define UART4_TX_PIN                            GPIO_PIN_0
#define UART4_RX_PIN                            GPIO_PIN_1
#define UART4_PORT                              GPIOA
#define UART4_GPIO_CLK_ENABLE()                 __GPIOA_CLK_ENABLE()  
#define UART4_GPIO_CLK_DISABLE()                __GPIOA_CLK_DISABLE()
#define UART4_CLK_ENABLE()               				__UART4_CLK_ENABLE()

