icprog/WT-8A46/Drivers/BSP/STM32F429I-WireTester/stm32f429i_WireTester.h
#define USART6_TX_PIN                           GPIO_PIN_6
#define USART6_RX_PIN                           GPIO_PIN_7
#define USART6_PORT                             GPIOC
#define USART6_GPIO_CLK_ENABLE()                __GPIOC_CLK_ENABLE()  
#define USART6_GPIO_CLK_DISABLE()               __GPIOC_CLK_DISABLE()
#define USART6_CLK_ENABLE()               			__USART6_CLK_ENABLE()
//------------------------------------------------------------------------
#define PowerSW_Audio_PIN                       GPIO_PIN_2	// PB2
#define PowerSW_WireLess_PIN                    GPIO_PIN_5	// PB5 
#define PowerSW_PORT                          	GPIOB
#define PowerSW_GPIO_CLK_ENABLE()             	__GPIOC_CLK_ENABLE()  
#define PowerSW_GPIO_CLK_DISABLE()            	__GPIOC_CLK_DISABLE()


#define BSP_UartAudio_PowerON()									HAL_GPIO_WritePin(PowerSW_PORT, PowerSW_Audio_PIN, GPIO_PIN_SET)
#define BSP_UartAudio_PowerOFF()								HAL_GPIO_WritePin(PowerSW_PORT, PowerSW_Audio_PIN, GPIO_PIN_RESET)
#define BSP_UartNRF_PowerON()										HAL_GPIO_WritePin(PowerSW_PORT, PowerSW_WireLess_PIN, GPIO_PIN_SET)
#define BSP_UartNRF_PowerOFF()									HAL_GPIO_WritePin(PowerSW_PORT, PowerSW_WireLess_PIN, GPIO_PIN_RESET)


#define UART_COM1																USART1
#define UART_24GHz															USART2 
#define UART_COM2																USART3 
#define UART_AUDIO															UART4 
#define UART_Infr																USART6 
//#define UART_AD																UART7 



/*##################### LCD ##################################################################*/

/* +------------------------+-----------------------+----------------------------+
   +                       LCD pins assignment                                   +
   +------------------------+-----------------------+----------------------------+
   |  LCD_TFT R2 <-> PH.08  |  LCD_TFT G2 <-> PH.13 |  LCD_TFT B2 <-> PG.10      |
   |  LCD_TFT R3 <-> PH.09  |  LCD_TFT G3 <-> PH.14 |  LCD_TFT B3 <-> PG.11      |
   |  LCD_TFT R4 <-> PH.10  |  LCD_TFT G4 <-> PH.15 |  LCD_TFT B4 <-> PI.04      |
   |  LCD_TFT R5 <-> PH.11  |  LCD_TFT G5 <-> PI.00 |  LCD_TFT B5 <-> PI.05      |
   |  LCD_TFT R6 <-> PH.12  |  LCD_TFT G6 <-> PI.01 |  LCD_TFT B6 <-> PI.06      |
   |  LCD_TFT R7 <-> PG.06  |  LCD_TFT G7 <-> PI.02 |  LCD_TFT B7 <-> PI.07      |
   -------------------------------------------------------------------------------
            |  LCD_TFT HSYNC <-> PI.10  | LCDTFT VSYNC <->  PI.09 |
            |  LCD_TFT PCLK  <-> PG.07  | LCD_TFT DE   <->  PF.10 |
             -----------------------------------------------------    */

/** 
  * @brief  LCD Control pin  
  */ 
#define LCD_PWM_PIN                GPIO_PIN_8
#define LCD_PWM_GPIO_PORT          GPIOB
#define LCD_PWM_GPIO_CLK_ENABLE()  __GPIOB_CLK_ENABLE()
#define LCD_PWM_GPIO_CLK_DISABLE() __GPIOB_CLK_DISABLE()
  
#define LCD_DISP_PIN                GPIO_PIN_9
#define LCD_DISP_GPIO_PORT          GPIOB
#define LCD_DISP_GPIO_CLK_ENABLE()  __GPIOB_CLK_ENABLE()
#define LCD_DISP_GPIO_CLK_DISABLE() __GPIOB_CLK_DISABLE()

/* Set PWM */
#define LCD_PWM_LOW()      HAL_GPIO_WritePin(LCD_PWM_GPIO_PORT, LCD_PWM_PIN, GPIO_PIN_RESET)
#define LCD_PWM_HIGH()     HAL_GPIO_WritePin(LCD_PWM_GPIO_PORT, LCD_PWM_PIN, GPIO_PIN_SET)

/* Set DISP */
#define LCD_DISP_OFF()     HAL_GPIO_WritePin(LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_RESET)
#define LCD_DISP_ON()      HAL_GPIO_WritePin(LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET)



/*##################### SDRAM ######################################################################*/

/*-- GPIOs Configuration -----------------------------------------------------*/
/*
 +-------------------+--------------------+--------------------+--------------------+
 +                       SDRAM pins assignment                                      +
 +-------------------+--------------------+--------------------+--------------------+
 | PD0  <-> FMC_D2   | PE0  <-> FMC_NBL0  | PF0  <-> FMC_A0    | PG0  <-> FMC_A10   |
 | PD1  <-> FMC_D3   | PE1  <-> FMC_NBL1  | PF1  <-> FMC_A1    | PG1  <-> FMC_A11   |
 | PD8  <-> FMC_D13  | PE7  <-> FMC_D4    | PF2  <-> FMC_A2    | PG4  <-> FMC_BA0   |
 | PD9  <-> FMC_D14  | PE8  <-> FMC_D5    | PF3  <-> FMC_A3    | PG5  <-> FMC_BA1   |
 | PD10 <-> FMC_D15  | PE9  <-> FMC_D6    | PF4  <-> FMC_A4    | PG8  <-> FMC_SDCLK |
 | PD14 <-> FMC_D0   | PE10 <-> FMC_D7    | PF5  <-> FMC_A5    | PG15 <-> FMC_NCAS  |  
 | PD15 <-> FMC_D1   | PE11 <-> FMC_D8    | PF11 <-> FMC_NRAS  |--------------------+  
 +-------------------| PE12 <-> FMC_D9    | PF12 <-> FMC_A6    | 
                     | PE13 <-> FMC_D10   | PF13 <-> FMC_A7    |    
                     | PE14 <-> FMC_D11   | PF14 <-> FMC_A8    |
                     | PE15 <-> FMC_D12   | PF15 <-> FMC_A9    |
 +-------------------+--------------------+--------------------+
 | PH7 <-> FMC_SDCKE1| 
 | PH6 <-> FMC_SDNE1 | 
 | PH5 <-> FMC_SDNWE |
 +-------------------+  */



/*##################### END ######################################################################*/




/**
  * @}
  */ 


/*##################### GYRO ##########################*/
/* Read/Write command */
//#define READWRITE_CMD              ((uint8_t)0x80) 
///* Multiple byte read/write command */ 
//#define MULTIPLEBYTE_CMD           ((uint8_t)0x40)
///* Dummy Byte Send by the SPI Master device in order to generate the Clock to the Slave device */
//#define DUMMY_BYTE                 ((uint8_t)0x00)

///* Chip Select macro definition */
//#define GYRO_CS_LOW()       HAL_GPIO_WritePin(GYRO_CS_GPIO_PORT, GYRO_CS_PIN, GPIO_PIN_RESET)
//#define GYRO_CS_HIGH()      HAL_GPIO_WritePin(GYRO_CS_GPIO_PORT, GYRO_CS_PIN, GPIO_PIN_SET)

///**
//  * @brief  GYRO SPI Interface pins
//  */
//#define GYRO_CS_PIN                    GPIO_PIN_1                  /* PC.01 */
//#define GYRO_CS_GPIO_PORT              GPIOC                       /* GPIOC */
//#define GYRO_CS_GPIO_CLK_ENABLE()      __GPIOC_CLK_ENABLE()
//#define GYRO_CS_GPIO_CLK_DISABLE()     __GPIOC_CLK_DISABLE()

//#define GYRO_INT_GPIO_CLK_ENABLE()         __GPIOA_CLK_ENABLE()
//#define GYRO_INT_GPIO_CLK_DISABLE()        __GPIOA_CLK_DISABLE()
//#define GYRO_INT_GPIO_PORT                 GPIOA                       /* GPIOA */
//#define GYRO_INT1_PIN                      GPIO_PIN_1                  /* PA.01 */
//#define GYRO_INT1_EXTI_IRQn                EXTI1_IRQn 
//#define GYRO_INT2_PIN                      GPIO_PIN_2                  /* PA.02 */
//#define GYRO_INT2_EXTI_IRQn                EXTI2_IRQn 
/**
  * @}
  */ 


#ifdef EE_M24LR64
/** @addtogroup STM32F429I_DISCOVERY LOW_LEVEL_I2C_EE
  * @{
  */
/**
  * @brief  I2C EEPROM Interface pins
  */
#define EEPROM_I2C_DMA                          DMA1   
#define EEPROM_I2C_DMA_CHANNEL                  DMA_CHANNEL_3
#define EEPROM_I2C_DMA_STREAM_TX                DMA1_Stream4
#define EEPROM_I2C_DMA_STREAM_RX                DMA1_Stream2
#define EEPROM_I2C_DMA_CLK_ENABLE()             __DMA1_CLK_ENABLE()
   
#define EEPROM_I2C_DMA_TX_IRQn                  DMA1_Stream4_IRQn
#define EEPROM_I2C_DMA_RX_IRQn                  DMA1_Stream2_IRQn
#define EEPROM_I2C_DMA_TX_IRQHandler            DMA1_Stream4_IRQHandler
#define EEPROM_I2C_DMA_RX_IRQHandler            DMA1_Stream2_IRQHandler
#define EEPROM_I2C_DMA_PREPRIO                  0
/**
  * @}
  */ 

/**
  * @}
  */  
#endif /*EE_M24LR64*/
/**
  * @}
  */

/** @defgroup STM32F429I_DISCOVERY LOW_LEVEL_Exported_Macros
  * @{
  */  
/**
  * @}
  */ 


/** @defgroup STM32F429I_DISCOVERY LOW_LEVEL_Exported_Functions
  * @{
  */
uint32_t  BSP_GetVersion(void);  
//void      BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode);
//uint32_t  BSP_PB_GetState(Button_TypeDef Button);
void CLK_Delay (uint32_t Delay);
void Infra_pwm_Init(void);
void Infra_PWM_ON(void);
void Infra_PWM_OFF(void);


/**
  * @}
  */
  
#ifdef __cplusplus
}
#endif

#endif /* __STM32F429I_DISCOVERY_H */
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
